src/main/resources/request/SendDeleteBulletinRequestMessage.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mes="http://schemas.consiliumtechnologies.com/services/mobile/2009/03/messaging" xmlns:com="http://schemas.consiliumtechnologies.com/mobile/2009/03/CommonMessages.xsd" xmlns:com1="http://schemas.consiliumtechnologies.com/mobile/2009/03/CommonTypes.xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <mes:SendDeleteBulletinRequestMessage>
            <!--Optional:-->
            <mes:SendMessageRequestInfo>
                <mes:QueueName>?</mes:QueueName>
                <!--Optional:-->
                <mes:CorrelationId>?</mes:CorrelationId>
                <mes:Key>?</mes:Key>
            </mes:SendMessageRequestInfo>
            <!--Optional:-->
            <mes:DeleteBulletinRequest>
                <com:BulletinRef>?</com:BulletinRef>
                <!--Optional:-->
                <com:Recipients>
                    <!--Zero or more repetitions:-->
                    <com1:User>
                        <!--Optional:-->
                        <com1:Attributes>
                            <!--Zero or more repetitions:-->
                            <com1:Attribute>
                                <!--Optional:-->
                                <com1:Name>?</com1:Name>
                                <!--Optional:-->
                                <com1:Value>?</com1:Value>
                            </com1:Attribute>
                        </com1:Attributes>
                        <!--Optional:-->
                        <com1:ID>?</com1:ID>
                        <!--Optional:-->
                        <com1:Name>?</com1:Name>
                        <!--Optional:-->
                        <com1:DeviceID>?</com1:DeviceID>
                    </com1:User>
                </com:Recipients>
            </mes:DeleteBulletinRequest>
        </mes:SendDeleteBulletinRequestMessage>
    </soapenv:Body>
</soapenv:Envelope>